art-den/co2meter/firmware/src/stm32_lib/hl_tim.hpp
template <unsigned N>
class GeneralPurposeTimer : public BasicTimer<N>
{
public:
	static void set_clock_division(TimerClockDivision value)
	{
		set_value_by_mask<uint32_t>(TIM_CR1, TIM_CR1_CKD, (uint32_t)value);
	}

	static void set_align(TimerAlign value)
	{
		set_value_by_mask<uint32_t>(TIM_CR1, TIM_CR1_CMS, (uint32_t)value);
	}

	static void set_direction(TimerDirection value)
	{
		set_value_by_mask<uint32_t>(TIM_CR1, TIM_CR1_DIR, (uint32_t)value);
	}

	static void connect_ch1_to_ti1_input()
	{
		clear_periph_reg_bit<TIM_CR2, TIM_CR2_TI1S>();
	}

	static void connect_ch1_ch2_ch3_to_ti1_input()
	{
		set_periph_reg_bit<TIM_CR2, TIM_CR2_TI1S>();
	}


	// DMA

	static void enable_trigger_dma_request()
	{
		set_periph_reg_bit<TIM_DIER, TIM_DIER_TDE>();
	}

	static void disable_trigger_dma_request()
	{
		clear_periph_reg_bit<TIM_DIER, TIM_DIER_TDE>();
	}

	static bool is_trigger_dma_request_enabled()
	{
		return get_periph_reg_bit<TIM_DIER, TIM_DIER_TDE>();
	}

	// interrupts

	static void enable_trigger_interrupt()
	{
		set_periph_reg_bit<TIM_DIER, TIM_DIER_TIE>();
	}

	static void disable_trigger_interrupt()
	{
		clear_periph_reg_bit<TIM_DIER, TIM_DIER_TIE>();
	}

	static bool is_trigger_interrupt_enabled()
	{
		return get_periph_reg_bit<TIM_DIER, TIM_DIER_TIE>();
	}

	template <unsigned Chan>
	static void enable_cc_interrupt()
	{
		static_assert(Chan >= 1 && Chan <= 4, "Wrong channel value");
		set_periph_reg_bit<TIM_DIER, 1 << Chan>();
		__DSB();
		__NOP();
	}

	template <unsigned Chan>
	static void disable_cc_interrupt()
	{
		static_assert(Chan >= 1 && Chan <= 4, "Wrong channel value");
		clear_periph_reg_bit<TIM_DIER, 1 << Chan>();
		__DSB();
		__NOP();
	}

	template <unsigned Chan>
	static bool is_cc_interrupt_enabled()
	{
		static_assert(Chan >= 1 && Chan <= 4, "Wrong channel value");
		return get_periph_reg_bit<TIM_DIER, 1 << Chan>();
	}

	// DMA

	template <unsigned Chan>
	static void enable_cc_dma_request()
	{
		static_assert(Chan >= 1 && Chan <= 4, "Wrong channel value");
		set_periph_reg_bit<TIM_DIER, detailed::TimerChanHelper<Chan>::cc_dma>();
	}

	template <unsigned Chan>
	static void disable_cc_dma_request()
	{
		static_assert(Chan >= 1 && Chan <= 4, "Wrong channel value");
		clear_periph_reg_bit<TIM_DIER, detailed::TimerChanHelper<Chan>::cc_dma>();
	}

	template <unsigned Chan>
	static bool is_cc_dma_request_enabled()
	{
		static_assert(Chan >= 1 && Chan <= 4, "Wrong channel value");
		return get_periph_reg_bit<TIM_DIER, detailed::TimerChanHelper<Chan>::cc_dma>();
	}


	// slave mode

	static void set_slave_mode(SlaveMode mode)
	{
		set_value_by_mask<uint32_t>(TIM_SMCR, TIM_SMCR_SMS, (uint32_t)mode);
	}

	static void set_slave_mode_trigger(SlaveModeTrigger trigger)
	{
		set_value_by_mask<uint32_t>(TIM_SMCR, TIM_SMCR_TS, (uint32_t)trigger);
	}

	static void enable_slave_mode()
	{
		set_periph_reg_bit<TIM_SMCR, TIM_SMCR_MSM>();
	}

	static void disable_slave_mode()
	{
		clear_periph_reg_bit<TIM_SMCR, TIM_SMCR_MSM>();
	}


	// status

	template <unsigned Chan>
	static bool get_overcapture_flag()
	{
		static_assert(Chan >= 1 && Chan <= 4, "Wrong channel value");
		constexpr unsigned mask = 1 << (Chan + 8);
		return get_periph_reg_bit<TIM_SR, mask>();
	}

	template <unsigned Chan>
	static void clear_overcapture_flag()
	{
		static_assert(Chan >= 1 && Chan <= 4, "Wrong channel value");
		HL_UI32REG(TIM_SR) = ~(1 << (Chan + 8));
		HL_UI32REG(TIM_SR);
	}

	static bool get_trigger_interrupt_flag()
	{
		return get_periph_reg_bit<TIM_SR, TIM_SR_TIF>() != 0;
	}

	static void reset_trigger_interrupt_flag()
	{
		HL_UI32REG(TIM_SR) = ~TIM_SR_TIF;
		HL_UI32REG(TIM_SR);
	}

	template <unsigned Chan>
	static bool get_cc_flag()
	{
		static_assert(Chan >= 1 && Chan <= 4, "Wrong channel value");
		constexpr unsigned mask = 1 << Chan;
		return get_periph_reg_bit<TIM_SR, mask>();
	}

	template <unsigned Chan>
	static void clear_cc_flag()
	{
		static_assert(Chan >= 1 && Chan <= 4, "Wrong channel value");
		HL_UI32REG(TIM_SR) = ~(1 << Chan);
		HL_UI32REG(TIM_SR);
	}

	//////

	template <unsigned Chan>
	static void disable_output_compare()
	{
		static_assert(Chan >= 1 && Chan <= 4, "Wrong channel value");

		typedef detailed::TimerChanHelper<Chan> ChanHelper;
		uint16_t tmp = HL_UI32REG(tim + ChanHelper::ccmr_offset);
		tmp &= ~(TIM_CCMR1_OC1CE << ChanHelper::ccmr_shift);
		HL_UI32REG(tim + ChanHelper::ccmr_offset) = tmp;
	}

	template <unsigned Chan>
	static void conf_pwm(PWMMode mode, PWMPolarity polarity, PWMPreload preload)
	{
		static_assert(Chan >= 1 && Chan <= 4, "Wrong channel value");

		typedef detailed::TimerChanHelper<Chan> ChanHelper;
		constexpr unsigned ccer_shift = (Chan-1) * 4;

		HL_UI32REG(TIM_CCER) &= ~(TIM_CCER_CC1E << ccer_shift); // disable channel before configure

		uint16_t ccmr = HL_UI32REG(tim + ChanHelper::ccmr_offset) & ~(0xFF << ChanHelper::ccmr_shift);
		uint16_t ccer = HL_UI32REG(TIM_CCER) & ~(0xF << ccer_shift);

		ccmr |= ((uint16_t)mode << ChanHelper::ccmr_shift);
		ccmr |= ((uint16_t)preload << ChanHelper::ccmr_shift);

		ccer |= ((uint16_t)polarity << ccer_shift);
		ccer |= (TIM_CCER_CC1E << ccer_shift); // signal is output on the corresponding output pin

		HL_UI32REG(TIM_CCER) = ccer;
		HL_UI32REG(tim + ChanHelper::ccmr_offset) = ccmr;
	}

	template <unsigned Chan>
	static void set_pwm_value(uint16_t value)
	{
		get_ccr<Chan>() = value;
	}

	template <unsigned Chan>
	static uint16_t get_pwm_value()
	{
		return get_ccr<Chan>();
	}


	template <unsigned Chan>
	static void conf_ic(
		ICChanMapping mapping,
		ICPolarity    polarity,
		ICPrescaler   prescaler,
		ICFilter      filter)
	{
		static_assert(Chan >= 1 && Chan <= 4, "Wrong channel value");

		typedef detailed::TimerChanHelper<Chan> ChanHelper;
		constexpr unsigned ccer_shift = (Chan-1) * 4;

		uint16_t ccer = HL_UI32REG(TIM_CCER);
		ccer &= ~(0xF << ccer_shift);
		uint16_t ccmr = HL_UI32REG(tim + ChanHelper::ccmr_offset);
		ccmr &= ~(0xFF << ChanHelper::ccmr_shift);

		ccmr |= ((uint16_t)mapping << ChanHelper::ccmr_shift); // channel mapping
		ccmr |= ((uint16_t)prescaler << ChanHelper::ccmr_shift); // prescaler
		ccmr |= ((uint16_t)filter << ChanHelper::ccmr_shift); // filter

		ccer |= ((uint16_t)polarity << ccer_shift); // polarity

		HL_UI32REG(tim + ChanHelper::ccmr_offset) = ccmr;
		HL_UI32REG(TIM_CCER) = ccer;
	}

	template <unsigned Chan>
	static void disable_capture()
	{
		static_assert(Chan >= 1 && Chan <= 4, "Wrong channel value");
		constexpr unsigned mask = TIM_CCER_CC1E << (Chan-1) * 4;
		clear_periph_reg_bit<TIM_CCER, mask>();
	}

	template <unsigned Chan>
	static void enable_capture()
	{
		static_assert(Chan >= 1 && Chan <= 4, "Wrong channel value");
		constexpr unsigned mask = TIM_CCER_CC1E << (Chan-1) * 4;
		set_periph_reg_bit<TIM_CCER, mask>();
	}

	template <unsigned Chan>
	static uint16_t get_cc_result()
	{
		return get_ccr<Chan>();
	}

	template <unsigned Chan>
	static uintptr_t get_cc_addr()
	{
		static_assert(Chan >= 1 && Chan <= 4, "Wrong channel value");
		typedef detailed::TimerChanHelper<Chan> ChanHelper;
		return tim + ChanHelper::ccr_offset;
	}



