art-den/co2meter/firmware/src/stm32_lib/hl_tim.hpp
private:
	using BasicTimer<N>::tim;
	using BasicTimer<N>::TIM_CR1;
	using BasicTimer<N>::TIM_CR2;
	using BasicTimer<N>::TIM_DIER;
	using BasicTimer<N>::TIM_SR;
	using BasicTimer<N>::TIM_SMCR;
	using BasicTimer<N>::TIM_CCER;

	template <unsigned Chan>
	static volatile uint32_t& get_ccr()
	{
		static_assert(Chan >= 1 && Chan <= 4, "Wrong channel value");
		typedef detailed::TimerChanHelper<Chan> ChanHelper;
		return HL_UI32REG(tim + ChanHelper::ccr_offset);
	}
};

///////////////////////////////////////////////////////////////////////////////

#ifdef TIM1
namespace detailed { template <> struct TimerHelper<1>
{
	static constexpr uintptr_t tim = TIM1_BASE;
	static constexpr IRQn_Type IRQn = TIM1_UP_TIM10_IRQn;
#ifdef RCC_APB2ENR_TIM1EN
	static constexpr uint32_t RccBit = RCC_APB2ENR_TIM1EN;
	static constexpr uintptr_t ClockRegister = RCC_BASE + offsetof(RCC_TypeDef, APB2ENR);
	static constexpr uintptr_t ResetRegister = RCC_BASE + offsetof(RCC_TypeDef, APB2RSTR);
#endif
}; }
typedef GeneralPurposeTimer<1> Timer1;
#endif // TIM1

#ifdef TIM2
namespace detailed { template <> struct TimerHelper<2>
{
	static constexpr uintptr_t tim = TIM2_BASE;
	static constexpr IRQn_Type IRQn = TIM2_IRQn;
#ifdef RCC_APB1ENR_TIM2EN
	static constexpr uint32_t RccBit = RCC_APB1ENR_TIM2EN;
	static constexpr uintptr_t ClockRegister = RCC_BASE + offsetof(RCC_TypeDef, APB1ENR);
	static constexpr uintptr_t ResetRegister = RCC_BASE + offsetof(RCC_TypeDef, APB1RSTR);
#endif
	
}; }
typedef GeneralPurposeTimer<2> Timer2;
#endif // TIM2

///////////////////////////////////////////////////////////////////////////////

#ifdef TIM3
namespace detailed { template <> struct TimerHelper<3>
{
	static constexpr uintptr_t tim = TIM3_BASE;
	static constexpr IRQn_Type IRQn = TIM3_IRQn;
#ifdef RCC_APB1ENR_TIM3EN
	static constexpr uint32_t RccBit = RCC_APB1ENR_TIM3EN;
	static constexpr uintptr_t ClockRegister = RCC_BASE + offsetof(RCC_TypeDef, APB1ENR);
	static constexpr uintptr_t ResetRegister = RCC_BASE + offsetof(RCC_TypeDef, APB1RSTR);
#endif
}; }
typedef GeneralPurposeTimer<3> Timer3;
#endif // TIM3

///////////////////////////////////////////////////////////////////////////////

#ifdef TIM4
namespace detailed { template <> struct TimerHelper<4>
{
	static constexpr uintptr_t tim = TIM4_BASE;
	static constexpr IRQn_Type IRQn = TIM4_IRQn;
#ifdef RCC_APB1ENR_TIM4EN
	static constexpr uint32_t RccBit = RCC_APB1ENR_TIM4EN;
	static constexpr uintptr_t ClockRegister = RCC_BASE + offsetof(RCC_TypeDef, APB1ENR);
	static constexpr uintptr_t ResetRegister = RCC_BASE + offsetof(RCC_TypeDef, APB1RSTR);
#endif
}; }
typedef GeneralPurposeTimer<4> Timer4;
#endif // TIM4

///////////////////////////////////////////////////////////////////////////////

#ifdef TIM5
namespace detailed { template <> struct TimerHelper<5>
{
	static constexpr uintptr_t tim = TIM5_BASE;
	static constexpr IRQn_Type IRQn = TIM5_IRQn;
#ifdef RCC_APB1ENR_TIM5EN
	static constexpr uint32_t RccBit = RCC_APB1ENR_TIM5EN;
	static constexpr uintptr_t ClockRegister = RCC_BASE + offsetof(RCC_TypeDef, APB1ENR);
	static constexpr uintptr_t ResetRegister = RCC_BASE + offsetof(RCC_TypeDef, APB1RSTR);
#endif
}; }
typedef GeneralPurposeTimer<5> Timer5;
#endif // TIM5

///////////////////////////////////////////////////////////////////////////////

#ifdef TIM6
namespace detailed { template <> struct TimerHelper<6>
{
	static constexpr uintptr_t tim = TIM6_BASE;
#if defined(HL_STM32L1XX)
	static constexpr IRQn_Type IRQn = TIM6_IRQn;
#elif defined(HL_STM32F3XX) || defined(HL_STM32F4XX)
	static constexpr IRQn_Type IRQn = TIM6_DAC_IRQn;
#endif
#ifdef RCC_APB1ENR_TIM6EN
	static constexpr uint32_t RccBit = RCC_APB1ENR_TIM6EN;
	static constexpr uintptr_t ClockRegister = RCC_BASE + offsetof(RCC_TypeDef, APB1ENR);
	static constexpr uintptr_t ResetRegister = RCC_BASE + offsetof(RCC_TypeDef, APB1RSTR);
#endif
}; }
typedef BasicTimer<6> Timer6;
#endif // TIM6

///////////////////////////////////////////////////////////////////////////////

#ifdef TIM7
namespace detailed { template <> struct TimerHelper<7>
{
	static constexpr uintptr_t tim = TIM7_BASE;
	static constexpr IRQn_Type IRQn = TIM7_IRQn;
#ifdef RCC_APB1ENR_TIM7EN
	static constexpr uint32_t RccBit = RCC_APB1ENR_TIM7EN;
	static constexpr uintptr_t ClockRegister = RCC_BASE + offsetof(RCC_TypeDef, APB1ENR);
	static constexpr uintptr_t ResetRegister = RCC_BASE + offsetof(RCC_TypeDef, APB1RSTR);
#endif
}; }
typedef BasicTimer<7> Timer7;
#endif // TIM7

///////////////////////////////////////////////////////////////////////////////

#ifdef TIM9
namespace detailed { template <> struct TimerHelper<9>
{
	static constexpr uintptr_t tim = TIM9_BASE;
#ifdef HL_STM32F4XX
	static constexpr IRQn_Type IRQn = TIM1_BRK_TIM9_IRQn;
#else
	static constexpr IRQn_Type IRQn = TIM9_IRQn;
#endif
#ifdef RCC_APB2ENR_TIM9EN
	static constexpr uint32_t RccBit = RCC_APB2ENR_TIM9EN;
	static constexpr uintptr_t ClockRegister = RCC_BASE + offsetof(RCC_TypeDef, APB2ENR);
	static constexpr uintptr_t ResetRegister = RCC_BASE + offsetof(RCC_TypeDef, APB2RSTR);
#endif
}; }
typedef GeneralPurposeTimer<9> Timer9;
#endif // TIM9

///////////////////////////////////////////////////////////////////////////////

#ifdef TIM10
namespace detailed { template <> struct TimerHelper<10>
{
	static constexpr uintptr_t tim = TIM10_BASE;
#ifdef RCC_APB2ENR_TIM10EN
	static constexpr uint32_t RccBit = RCC_APB2ENR_TIM10EN;
	static constexpr uintptr_t ClockRegister = RCC_BASE + offsetof(RCC_TypeDef, APB2ENR);
	static constexpr uintptr_t ResetRegister = RCC_BASE + offsetof(RCC_TypeDef, APB2RSTR);
#endif
#ifdef HL_STM32F4XX
	static constexpr IRQn_Type IRQn = TIM1_UP_TIM10_IRQn;
#else
	static constexpr IRQn_Type IRQn = TIM10_IRQn;
#endif
}; }
typedef GeneralPurposeTimer<10> Timer10;
#endif // TIM10

///////////////////////////////////////////////////////////////////////////////

#ifdef TIM11
namespace detailed { template <> struct TimerHelper<11>
{
	static constexpr uintptr_t tim = TIM11_BASE;
#ifdef HL_STM32F4XX
	static constexpr IRQn_Type IRQn = TIM1_TRG_COM_TIM11_IRQn;
#else
	static constexpr IRQn_Type IRQn = TIM11_IRQn;
#endif
#ifdef RCC_APB2ENR_TIM11EN
	static constexpr uint32_t RccBit = RCC_APB2ENR_TIM11EN;
	static constexpr uintptr_t ClockRegister = RCC_BASE + offsetof(RCC_TypeDef, APB2ENR);
	static constexpr uintptr_t ResetRegister = RCC_BASE + offsetof(RCC_TypeDef, APB2RSTR);
#endif
}; }
typedef GeneralPurposeTimer<11> Timer11;
#endif // TIM11

///////////////////////////////////////////////////////////////////////////////

