art-den/co2meter/firmware/src/stm32_lib/hl_tim.hpp
#if defined(TIM15) && defined(RCC_APB2ENR_TIM15EN)
namespace detailed { template <> struct TimerHelper<15>
{
	static constexpr uintptr_t tim = TIM15_BASE;
	static constexpr uint32_t RccBit = RCC_APB2ENR_TIM15EN;
	static constexpr uintptr_t ClockRegister = RCC_BASE + offsetof(RCC_TypeDef, APB2ENR);
	static constexpr uintptr_t ResetRegister = RCC_BASE + offsetof(RCC_TypeDef, APB2RSTR);
#if defined(HL_STM32F1XX)
	static constexpr IRQn_Type IRQn = TIM1_BRK_TIM15_IRQn;
#else
	static constexpr IRQn_Type IRQn = TIM15_IRQn;
#endif
}; }
typedef GeneralPurposeTimer<15> Timer15;
#endif // TIM15

///////////////////////////////////////////////////////////////////////////////

#if defined(TIM16) && defined(RCC_APB2ENR_TIM16EN)
namespace detailed { template <> struct TimerHelper<16>
{
	static constexpr uintptr_t tim = TIM16_BASE;
	static constexpr uint32_t RccBit = RCC_APB2ENR_TIM16EN;
	static constexpr uintptr_t ClockRegister = RCC_BASE + offsetof(RCC_TypeDef, APB2ENR);
	static constexpr uintptr_t ResetRegister = RCC_BASE + offsetof(RCC_TypeDef, APB2RSTR);
#if defined(HL_STM32F1XX)
	static constexpr IRQn_Type IRQn = TIM1_UP_TIM16_IRQn;
#else
	static constexpr IRQn_Type IRQn = TIM16_IRQn;
#endif
}; }
typedef GeneralPurposeTimer<16> Timer16;
#endif // TIM16

///////////////////////////////////////////////////////////////////////////////

#ifdef TIM17
namespace detailed { template <> struct TimerHelper<17>
{
	static constexpr uintptr_t tim = TIM17_BASE;
#if defined(HL_STM32F1XX)
	static constexpr IRQn_Type IRQn = TIM1_TRG_COM_TIM17_IRQn;
#else
	static constexpr IRQn_Type IRQn = TIM17_IRQn;
#endif
#ifdef RCC_APB2ENR_TIM17EN
	static constexpr uint32_t RccBit = RCC_APB2ENR_TIM17EN;
	static constexpr uintptr_t ClockRegister = RCC_BASE + offsetof(RCC_TypeDef, APB2ENR);
	static constexpr uintptr_t ResetRegister = RCC_BASE + offsetof(RCC_TypeDef, APB2RSTR);
#endif
}; }
typedef GeneralPurposeTimer<17> Timer17;
#endif // TIM17

///////////////////////////////////////////////////////////////////////////////

namespace detailed {

template <> struct TimerChanHelper<1>
{
	static constexpr uint32_t ccmr_offset = offsetof(TIM_TypeDef, CCMR1);
	static constexpr uint32_t ccr_offset = offsetof(TIM_TypeDef, CCR1);
	static constexpr unsigned ccmr_shift = 0;
	static constexpr uint32_t cc_dma = TIM_DIER_CC1DE;
};

///////////////////////////////////////////////////////////////////////////////

template <> struct TimerChanHelper<2>
{
	static constexpr uint32_t ccmr_offset = offsetof(TIM_TypeDef, CCMR1);
	static constexpr uint32_t ccr_offset = offsetof(TIM_TypeDef, CCR2);
	static constexpr unsigned ccmr_shift = 8;
	static constexpr uint32_t cc_dma = TIM_DIER_CC2DE;
};

///////////////////////////////////////////////////////////////////////////////

template <> struct TimerChanHelper<3>
{
	static constexpr uint32_t ccmr_offset = offsetof(TIM_TypeDef, CCMR2);
	static constexpr uint32_t ccr_offset = offsetof(TIM_TypeDef, CCR3);
	static constexpr unsigned ccmr_shift = 0;
	static constexpr uint32_t cc_dma = TIM_DIER_CC3DE;
};

///////////////////////////////////////////////////////////////////////////////

template <> struct TimerChanHelper<4>
{
	static constexpr uint32_t ccmr_offset = offsetof(TIM_TypeDef, CCMR2);
	static constexpr uint32_t ccr_offset = offsetof(TIM_TypeDef, CCR4);
	static constexpr unsigned ccmr_shift = 8;
	static constexpr uint32_t cc_dma = TIM_DIER_CC4DE;
};

///////////////////////////////////////////////////////////////////////////////

} // namespace detailed
} // namespace hl
